{"modelTopology":{"class_name":"Sequential","config":{"name":"mobileNetMini","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"ZeroPadding2D","config":{"padding":[[2,2],[2,2]],"data_format":"channels_last","name":"zero_padding2d_ZeroPadding2D1","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU1","trainable":true}},{"class_name":"SeparableConv2D","config":{"filters":16,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D1","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU2","trainable":true}},{"class_name":"SeparableConv2D","config":{"filters":32,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D2","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU3","trainable":true}},{"class_name":"SeparableConv2D","config":{"filters":64,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D3","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU4","trainable":true}},{"class_name":"SeparableConv2D","config":{"filters":128,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D4","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true}},{"class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU5","trainable":true}},{"class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"global_average_pooling2d_GlobalAveragePooling2D1","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[3,3,1,8],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[8],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/depthwise_kernel","shape":[3,3,8,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/pointwise_kernel","shape":[1,1,8,16],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[16],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/depthwise_kernel","shape":[3,3,16,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/pointwise_kernel","shape":[1,1,16,32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/pointwise_kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[64],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D4/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D4/pointwise_kernel","shape":[1,1,64,128],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D4/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[128,10],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[10],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[128],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}